Repository: nh36/ChinTransMem
Catalog: corpus/candidates/liji/exports/tmx/liji__liji-039-the-long-dress-in-one-piece__aligned_passages.tmx
Source language: zh_hant
Languages: en

source: 古者深衣，蓋有制度，以應規、矩、繩、權、衡。短毋見膚，長毋被土。續衽，鉤邊。要縫半下；袼之高下，可以運肘；袂之長短，反詘之及肘。帶下毋厭髀，上毋厭脅，當無骨者。
en: Anciently the long dress had definite measurements, so as to satisfy the requirements of the compass and square, the line, the balance, and the steelyard. It was not made so short as to show any of the skin, nor so long as to touch the ground. The outside pieces of the skirt joined, and were hooked together at the side; (the width of) the seam at the waist was half that at the bottom (of the skirt). The sleeve was joined to the body of the dress at the arm-pit, so as to allow the freest movement of the elbow-joint; the length of the lower part admitted of the cuffs being turned back to the elbow. The sash was put on where there were no bones, so as not to interfere with the action of the thighs below or of the ribs above.

source: 制：十有二幅以應十有二月；袂圜以應規；曲袷如矩以應方；負繩及踝以應直；下齊如權衡以應平。
en: In the making (of the garment) twelve strips (of the cloth) were used, to correspond to the twelve months. The sleeve was made round, as if fashioned by a disk. The opening at the neck was square, as if made by means of that instrument so named. The cord-like (seam) at the back descended to the ankles, as if it had been a straight line. The edge at the bottom was like the steelyard of a balance, made perfectly even.

source: 故規者，行舉手以為容；負繩抱方者，以直其政，方其義也。故《易》曰：坤，「六二之動，直以方」也。下齊如權衡者，以安志而平心也。
en: In this way through the rounded sleeves the arms could be lifted up in walking (for the purpose of salutation) in the most elegant form. The cord-like seam of the back and the square-shaped collar about the neck in front, served to admonish (the wearer) how his government should be correct and his righteousness on the square. It is said in the Yi, 'The movement indicated by the second line in Kun, divided, is "from the straight (line) to the square."' The even edge at the bottom, like the steelyard and balance, admonished him to keep his will at rest, and his heart even and calm.

source: 五法已施，故聖人服之。故規矩取其無私，繩取其直，權衡取其平，故先王貴之。故可以為文，可以為武，可以擯相，可以治軍旅，完且弗費，善衣之次也。
en: These five rules being observed in the making (of the dress), the sages wore it. In its squareness and roundness they saw its warning against selfishness; in its line-like straightness they saw its admonition to be correct, and in its balance-like evenness they saw its lesson of impartiality. Therefore the ancient kings attached a high value to it; it could be worn in the discharge of both their civil and military duties; in it they could receive visitors and regulate the cohorts of their armies. It was complete, but not extravagant; it ranked in the second class of good dresses.

source: 具父母、大父母，衣純以繢；具父母，衣純以青。如孤子，衣純以素。純袂、緣、純邊，廣各寸半。
en: For ornament, while his parents and grandparents were alive, (a son) wore the dress with its border embroidered. If (only) his parents were alive, the ornamental border was blue. In the case of an orphan son, the border was white. The border round the mouth of the sleeves and all the edges of the dress was an inch and a half wide.
